---
kind: method
id: M:Autodesk.Revit.UI.UIThemeManager.GetThemeName(Autodesk.Revit.UI.UITheme)
source: html/7d66a16e-5e18-713e-c0fc-67765284a1b0.htm
---
# Autodesk.Revit.UI.UIThemeManager.GetThemeName Method

Gets the theme name for the given theme type.

## Syntax (C#)
```csharp
public static string GetThemeName(
	UITheme frameTheme
)
```

## Parameters
- **frameTheme** (`Autodesk.Revit.UI.UITheme`) - The theme.

## Returns
The name of the theme.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - A value passed for an enumeration argument is not a member of that enumeration